/*
 * @Author: kael 
 * @Date: 2018-02-14 17:50:28 
 * @Last Modified by: mikey.zhaopeng
 * @Last Modified time: 2018-07-08 20:22:43
 */

/**
  emial 规则
  1. @之前必须有内容且只能是字母（大小写）、数字、下划线(_)、减号（-）、点（.）
  2. @和最后一个点（.）之间必须有内容且只能是字母（大小写）、数字、点（.）、减号（-），且两个点不能挨着
  3. 最后一个点（.）之后必须有内容且内容只能是字母（大小写）、数字且长度为大于等于2个字节，小于等于6个字节

  ----------------------------------------------
  ipv4 规则 每位都小于255
  1. 0-99的数字 : \d{2}
  2. 100 - 199 : 1\d{2}
  3. 2开头, 第二位为 0-4, 第三位数字随意 200-249 : 2[0-4]\d
  3. 250 - 255 : 25[0-5]

  ----------------------------------------------
  身份证规则
  xxxxxx yyyy MM dd 375 0     十八位
  xxxxxx yy MM dd   75 0     十五位

  \d{6} 1[89]\d{2} 0[1-9]|1[0-2] 0[1-9]|[12]\d|3[0-1] \d{3}[\dXx] 
  \d{6} \d{2} 0[1-9]|1[0-2] 0[1-9]|[12]\d|3[0-1] \d{3}[\dXx] 

  ----------------------------------------------
 */
module.exports = {
  mobile: /^1\d{10}$/,
  qq: /^[1-9]\d{4,10}$/,
  number: /^[-+]?(?:\d*|(?=\d))(\.\d*)?$/,
  email: /^[\w\.-]+@[\w\.-]+(\.[A-Za-z\d]{2,6}){1,2}$/,
  url: /^(http)s?:\/\/(\w+\.){2,}\w+(:\d{2,4})?(\/\w+)*\/?$/,
  ipv4: /^((\d{0,2}|1\d{2}|2[0-4]\d|25[0-5])\.){3}(\d{0,2}|1\d{2}|2[0-4]\d|25[0-5])$/,
  idcard: /^\d{6}(1[89]|20)?\d{2}(0[1-9]|1[0-2])(0[1-9]|[12]\d|3[0-1])\d{3}[\dXx]$/,
};